In [187]:
import pandas as pd
import numpy as np

# series

In [188]:
myDistionary ={"Dogukan":20 , "Arif":25, "Sevval":21}

In [189]:
pd.Series(myDistionary)

Dogukan    20
Arif       25
Sevval     21
dtype: int64

In [190]:
myAges=[20,25,21]
myNames=["Dogukan","Arif","Sevval"]

In [191]:
pd.Series(myAges)

0    20
1    25
2    21
dtype: int64

In [192]:
pd.Series(myAges,myNames)

Dogukan    20
Arif       25
Sevval     21
dtype: int64

In [193]:
pd.Series(data=myAges,index=myNames)

Dogukan    20
Arif       25
Sevval     21
dtype: int64

In [194]:
pd.Series(["Dogu","Sevval"],[1,2])

1      Dogu
2    Sevval
dtype: object

In [195]:
yarismaSonucu1= pd.Series([10,1,5],["Sevval","Dogu","Arif"])

In [196]:
yarismaSonucu1

Sevval    10
Dogu       1
Arif       5
dtype: int64

In [197]:
yarismaSonucu2= pd.Series([20,7,8],["Sevval","Dogu","Arif"])

In [198]:
yarismaSonucu2

Sevval    20
Dogu       7
Arif       8
dtype: int64

In [199]:
yarismaSonucu1+yarismaSonucu2

Sevval    30
Dogu       8
Arif      13
dtype: int64

In [200]:
yarismaSonucu1["Sevval"]

10

# DataFrame

In [201]:
data = np.random.randn(4,3)

In [202]:
data

array([[-1.73050432, -0.80127527, -0.59324269],
       [ 2.0467102 , -1.41303778, -0.11313135],
       [-0.83399296, -0.22358036,  1.34940022],
       [ 1.78442297,  0.1706424 ,  0.87315338]])

In [203]:
dataFrame = pd.DataFrame(data)

In [204]:
dataFrame

          0         1         2
0 -1.730504 -0.801275 -0.593243
1  2.046710 -1.413038 -0.113131
2 -0.833993 -0.223580  1.349400
3  1.784423  0.170642  0.873153

In [205]:
dataFrame[0]

0   -1.730504
1    2.046710
2   -0.833993
3    1.784423
Name: 0, dtype: float64

In [206]:
newDataFrame=pd.DataFrame(data,index=["X","Y","Z","T"],columns=["A","B","C"])

In [207]:
newDataFrame

          A         B         C
X -1.730504 -0.801275 -0.593243
Y  2.046710 -1.413038 -0.113131
Z -0.833993 -0.223580  1.349400
T  1.784423  0.170642  0.873153

In [208]:
newDataFrame["A"]

X   -1.730504
Y    2.046710
Z   -0.833993
T    1.784423
Name: A, dtype: float64

In [209]:
newDataFrame[["A","B"]]

          A         B
X -1.730504 -0.801275
Y  2.046710 -1.413038
Z -0.833993 -0.223580
T  1.784423  0.170642

In [210]:
newDataFrame.loc["X"]
#satir bilgileri verir

A   -1.730504
B   -0.801275
C   -0.593243
Name: X, dtype: float64

In [211]:
newDataFrame.iloc[1]
#index location

A    2.046710
B   -1.413038
C   -0.113131
Name: Y, dtype: float64

In [212]:
newDataFrame["D"]=newDataFrame["B"]+newDataFrame["B"]

In [213]:
newDataFrame

          A         B         C         D
X -1.730504 -0.801275 -0.593243 -1.602551
Y  2.046710 -1.413038 -0.113131 -2.826076
Z -0.833993 -0.223580  1.349400 -0.447161
T  1.784423  0.170642  0.873153  0.341285

In [214]:
newDataFrame.drop("D",axis=1)
# sutun silme

          A         B         C
X -1.730504 -0.801275 -0.593243
Y  2.046710 -1.413038 -0.113131
Z -0.833993 -0.223580  1.349400
T  1.784423  0.170642  0.873153

In [215]:
newDataFrame.drop("X")
#satır silme

          A         B         C         D
Y  2.046710 -1.413038 -0.113131 -2.826076
Z -0.833993 -0.223580  1.349400 -0.447161
T  1.784423  0.170642  0.873153  0.341285

In [216]:
newDataFrame

          A         B         C         D
X -1.730504 -0.801275 -0.593243 -1.602551
Y  2.046710 -1.413038 -0.113131 -2.826076
Z -0.833993 -0.223580  1.349400 -0.447161
T  1.784423  0.170642  0.873153  0.341285

In [217]:
#eger drop kalıcı yaparsak
newDataFrame.drop("D",axis=1,inplace=True)

In [218]:
newDataFrame

          A         B         C
X -1.730504 -0.801275 -0.593243
Y  2.046710 -1.413038 -0.113131
Z -0.833993 -0.223580  1.349400
T  1.784423  0.170642  0.873153

In [219]:
newDataFrame>0

       A      B      C
X  False  False  False
Y   True  False  False
Z  False  False   True
T   True   True   True

In [220]:
booleanDataFrame=newDataFrame>0

In [221]:
newDataFrame[booleanDataFrame]

          A         B         C
X       NaN       NaN       NaN
Y  2.046710       NaN       NaN
Z       NaN       NaN  1.349400
T  1.784423  0.170642  0.873153

In [222]:
newDataFrame.reset_index()

  index         A         B         C
0     X -1.730504 -0.801275 -0.593243
1     Y  2.046710 -1.413038 -0.113131
2     Z -0.833993 -0.223580  1.349400
3     T  1.784423  0.170642  0.873153

In [223]:
newDataFrame

          A         B         C
X -1.730504 -0.801275 -0.593243
Y  2.046710 -1.413038 -0.113131
Z -0.833993 -0.223580  1.349400
T  1.784423  0.170642  0.873153

In [224]:
newIndex =["xx","yy","zz","tt"]
newDataFrame["New Index"] = newIndex
newDataFrame

          A         B         C New Index
X -1.730504 -0.801275 -0.593243        xx
Y  2.046710 -1.413038 -0.113131        yy
Z -0.833993 -0.223580  1.349400        zz
T  1.784423  0.170642  0.873153        tt

In [225]:
#newDataFrame.set_index("New Index")
#gecici

In [226]:
newDataFrame.set_index("New Index",inplace=True)

In [227]:
newDataFrame

                  A         B         C
New Index
xx        -1.730504 -0.801275 -0.593243
yy         2.046710 -1.413038 -0.113131
zz        -0.833993 -0.223580  1.349400
tt         1.784423  0.170642  0.873153

In [228]:
#inplace=True kalıcı demektir


#multiIndex konusu var->lazımsa kullan
#loc.Loc

# Operations

eksik veri

In [229]:
sozlukVerisi= {"Istanbul" :[30,29,np.nan],"Ankara" : [20,np.nan,25], "Izmir" : [40,39,28]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [230]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     28

In [231]:
gunler=["pazartesi","sali","carsamba"]
havaDurumuDataFrame["Gunler"]=gunler
havaDurumuDataFrame.set_index("Gunler",inplace=True)

In [232]:
havaDurumuDataFrame

           Istanbul  Ankara  Izmir
Gunler
pazartesi      30.0    20.0     40
sali           29.0     NaN     39
carsamba        NaN    25.0     28

In [233]:
havaDurumuDataFrame.dropna()

           Istanbul  Ankara  Izmir
Gunler
pazartesi      30.0    20.0     40

In [234]:
havaDurumuDataFrame.dropna(axis=1)

           Izmir
Gunler
pazartesi     40
sali          39
carsamba      28

In [235]:
havaDurumuDataFrame.dropna(axis=1,thresh=2)
#bir satırda 2 nan varsa sil

           Istanbul  Ankara  Izmir
Gunler
pazartesi      30.0    20.0     40
sali           29.0     NaN     39
carsamba        NaN    25.0     28

# groupby

In [236]:
maasSozluk= {"Departmanlar":["Yazilim","Yazilim","Pazarlama","Pazarlama","İK","İK"],
             "Calisan Ismi":["Ali","Veli","Salih","Enes","Memo","Semi"],
            "Maas" :[100,20,300,400,50,600]
            }

In [237]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [238]:
maasDataFrame

  Departmanlar Calisan Ismi  Maas
0      Yazilim          Ali   100
1      Yazilim         Veli    20
2    Pazarlama        Salih   300
3    Pazarlama         Enes   400
4           İK         Memo    50
5           İK         Semi   600

In [239]:
groupObjesi=maasDataFrame.groupby("Departmanlar")

In [240]:
groupObjesi.count()

              Calisan Ismi  Maas
Departmanlar
Pazarlama                2     2
Yazilim                  2     2
İK                       2     2

In [241]:
groupObjesi.mean()

              Maas
Departmanlar
Pazarlama      350
Yazilim         60
İK             325

In [242]:
groupObjesi.max()

             Calisan Ismi  Maas
Departmanlar
Pazarlama           Salih   400
Yazilim              Veli   100
İK                   Semi   600

In [243]:
groupObjesi.describe()

              Maas
             count   mean         std    min    25%    50%    75%    max
Departmanlar
Pazarlama      2.0  350.0   70.710678  300.0  325.0  350.0  375.0  400.0
Yazilim        2.0   60.0   56.568542   20.0   40.0   60.0   80.0  100.0
İK             2.0  325.0  388.908730   50.0  187.5  325.0  462.5  600.0

# Concat

In [244]:
sozluk1={"Isim":["a","b","c","d"],"Spor":[1,2,3,4],
        "Kalori":[100,200,300,400]}
dataFrame1=pd.DataFrame(sozluk1)

In [245]:
dataFrame1

  Isim  Spor  Kalori
0    a     1     100
1    b     2     200
2    c     3     300
3    d     4     400

In [246]:
sozluk2={"Isim":["e","f","g","g"],"Spor":[5,6,3,4],
        "Kalori":[1200,200,400,500]}
dataFrame2=pd.DataFrame(sozluk2)

In [247]:
dataFrame2

  Isim  Spor  Kalori
0    e     5    1200
1    f     6     200
2    g     3     400
3    g     4     500

In [248]:
sozluk3={"Isim":["h","x","y","y"],"Spor":[1,5,3,4],
        "Kalori":[1200,200,500,1200]}
dataFrame3=pd.DataFrame(sozluk3)

In [249]:
dataFrame3

  Isim  Spor  Kalori
0    h     1    1200
1    x     5     200
2    y     3     500
3    y     4    1200

In [250]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

  Isim  Spor  Kalori
0    a     1     100
1    b     2     200
2    c     3     300
3    d     4     400
0    e     5    1200
1    f     6     200
2    g     3     400
3    g     4     500
0    h     1    1200
1    x     5     200
2    y     3     500
3    y     4    1200

# Merge

In [251]:
mergeSozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Arif"],
             "Spor":["Futbol","Basket","Voleybol","Kosu"]}
mergeDataFrame1=pd.DataFrame(mergeSozluk1)
mergeDataFrame1

     Isim      Spor
0   Ahmet    Futbol
1  Mehmet    Basket
2  Zeynep  Voleybol
3    Arif      Kosu

In [252]:
mergeSozluk2={"Isim":["Ahmet","Mehmet","Zeynep","Arif"],
             "Kalori":[100,200,300,400]}
mergeDataFrame2=pd.DataFrame(mergeSozluk2)
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     300
3    Arif     400

In [253]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim      Spor  Kalori
0   Ahmet    Futbol     100
1  Mehmet    Basket     200
2  Zeynep  Voleybol     300
3    Arif      Kosu     400

In [254]:
#sutunları birleştirdik

In [255]:
#unique,nuniqe
#value_counts
#apply(fonksiyonAdi)
#isnull()
#pivot_table

# with Excel

In [259]:
dataFrameExcel=pd.read_excel("EXCEL ÇALIŞMA DOSYAM.xlsx")
#this is sample coding line

dataFrameExcel.to_excel("name.xlsx")

FileNotFoundError: [Errno 2] No such file or directory: 'EXCEL ÇALIŞMA DOSYAM.xlsx'